#include <stdio.h> // สำหรับใช้ฟังก์ชัน printf()

int main() { // ประกาศตัวแปรและกำหนดค่าเริ่มต้น
    int a = 10; // Data Type: int (สำหรับเก็บจำนวนเต็ม)
    printf("a = %d\n", a); // แสดงผลลัพธ์ออกทางหน้าจอ
    return 0; // คืนค่า 0 แสดงว่าโปรแกรมทำงานเสร็จสมบูรณ์
}
//ข้อผิดพลาดที่เกิดขึ้น
  // ขาดเครืองหมายหน้า include เเละขาดเครื่องหมาย ; ท้ายคำสั่ง printf เเละ return
//คอมเมนต์อธิบาย
  // โค้ดเเก้ไขเเล้วจะทำงานได้ถูกต้อง โดยการเพิ่มเครื่องหมาย ; ท้ายคำสั่ง printf และ return
//รันโปรเเกรม
  // เมื่อรันโปรแกรมเเล้วไม่เกิดข้อผิดพลาดใดๆ และจะแสดงผลลัพธ์เป็น "a = 10" บนหน้าจอ
//ผลลัพธ์ที่ได้
  // ผลลัพธ์ที่ได้จะแสดงค่าของตัวแปร a ซึ่งคือ 10 บนหน้าจอ
  
